h-0-30deg/0/k
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];
internalField   uniform 0.09375;

boundaryField
{
    inlet
    {
        type atmBoundaryLayerInletK;
	flowDir (1 0 0);
	zDir    (0 0 1);
	kappa   0.41;
	Cmu     0.09;
        Uref    5;
        Zref    1;
        value 	uniform 0.09375;
	z0	uniform 0.0024;
	zGround uniform 0;
    }

    outlet
    {
        type inletOutlet;
	inletValue  uniform 0.09375;
	value	    uniform 0.09375;
    }

    ground
    {
        type kqRWallFunction;
        value uniform 0.09375;
    }

    sky
    {
        type zeroGradient;
    }

    side_d
    {
        type symmetryPlane;
    }

    side_e
    {
        type symmetryPlane;
    }

    body
    {
        type kqRWallFunction;
        value uniform 0.09375;
    }
    neighborhood
    {
        type kqRWallFunction;
        value uniform 0.09375;
    }
}

// ************************************************************************* //
